<?xml version="1.0" ?>
<net name="person-vehicle-bike-detection-2000" version="10">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,256,256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="21412145_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="2" name="21422146_const" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="3" name="21432147_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="21442148_const" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="5" name="Mul_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Mul_/fq_input_1/Convert_to_float/Cast_08713_const" type="Const" version="opset1">
			<data element_type="u8" offset="4" shape="1,1,1,1" size="1"/>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Mul_/fq_input_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Mul_/fq_input_1/Copy/out_low7871_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Mul_/fq_input_1/Copy/out_high7872_const" type="Const" version="opset1">
			<data element_type="f16" offset="5" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="21532157_const" type="Const" version="opset1">
			<data element_type="f16" offset="7" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="21542158_const" type="Const" version="opset1">
			<data element_type="f16" offset="9" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Mul_/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="19411945_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="15" name="19421946_const" type="Const" version="opset1">
			<data element_type="f16" offset="11" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="16" name="19431947_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="17" name="19441948_const" type="Const" version="opset1">
			<data element_type="f16" offset="11" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="18" name="Conv_0/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_0/fq_weights_1/Convert_to_float/Cast_08753_const" type="Const" version="opset1">
			<data element_type="u8" offset="13" shape="32,3,3,3" size="864"/>
			<output>
				<port id="1" precision="U8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_0/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_0/fq_weights_1/Copy/out_low7743_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_0/fq_weights_1/Copy/out_high7744_const" type="Const" version="opset1">
			<data element_type="f16" offset="5" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="19531957_const" type="Const" version="opset1">
			<data element_type="f16" offset="877" shape="32,1,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="19541958_const" type="Const" version="opset1">
			<data element_type="f16" offset="941" shape="32,1,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_0/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_0" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_12292/copy_const404_const" type="Const" version="opset1">
			<data element_type="f16" offset="1005" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="BatchNormalization_1/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Clip_2" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="23212325_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="31" name="23222326_const" type="Const" version="opset1">
			<data element_type="f16" offset="1069" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="32" name="23232327_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="33" name="23242328_const" type="Const" version="opset1">
			<data element_type="f16" offset="1069" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="34" name="Conv_3/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_3/fq_weights_1/Convert_to_float/Cast_08683_const" type="Const" version="opset1">
			<data element_type="u8" offset="1071" shape="32,32,1,1" size="1024"/>
			<output>
				<port id="1" precision="U8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_3/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_3/fq_weights_1/Copy/out_low7599_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_3/fq_weights_1/Copy/out_high7600_const" type="Const" version="opset1">
			<data element_type="f16" offset="5" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="23332337_const" type="Const" version="opset1">
			<data element_type="f16" offset="2095" shape="32,1,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="23342338_const" type="Const" version="opset1">
			<data element_type="f16" offset="2159" shape="32,1,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_3/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_3" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_1229512300/copy_const409_const" type="Const" version="opset1">
			<data element_type="f16" offset="2223" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="BatchNormalization_4/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Clip_5" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="13411345_const" type="Const" version="opset1">
			<data element_type="f16" offset="2287" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="13421346_const" type="Const" version="opset1">
			<data element_type="f16" offset="2351" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="13431347_const" type="Const" version="opset1">
			<data element_type="f16" offset="2287" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="13441348_const" type="Const" version="opset1">
			<data element_type="f16" offset="2351" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_6/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_6/fq_weights_1/Convert_to_float/Cast_08799_const" type="Const" version="opset1">
			<data element_type="u8" offset="2415" shape="32,1,3,3" size="288"/>
			<output>
				<port id="1" precision="U8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_6/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_6/fq_weights_1/Copy/out_low7607_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_6/fq_weights_1/Copy/out_high7608_const" type="Const" version="opset1">
			<data element_type="f16" offset="5" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="13531357_const" type="Const" version="opset1">
			<data element_type="f16" offset="2703" shape="32,1,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="13541358_const" type="Const" version="opset1">
			<data element_type="f16" offset="2767" shape="32,1,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_6/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="9532/value9534_const" type="Const" version="opset1">
			<data element_type="i64" offset="2831" shape="5" size="40"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="9532" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_6" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="data_add_1230312308/copy_const414_const" type="Const" version="opset1">
			<data element_type="f16" offset="2871" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="BatchNormalization_7/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Clip_8" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="BatchNormalization_10/mean/Fused_Mul_1342413426_const417_const" type="Const" version="opset1">
			<data element_type="f16" offset="2935" shape="16,32,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_9" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="data_add_1231112316/copy_const419_const" type="Const" version="opset1">
			<data element_type="f16" offset="3959" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="BatchNormalization_10/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="14011405_const" type="Const" version="opset1">
			<data element_type="f16" offset="3991" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="69" name="14021406_const" type="Const" version="opset1">
			<data element_type="f16" offset="3993" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="70" name="14031407_const" type="Const" version="opset1">
			<data element_type="f16" offset="3991" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="71" name="14041408_const" type="Const" version="opset1">
			<data element_type="f16" offset="3993" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="72" name="Conv_11/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_11/fq_weights_1/Convert_to_float/Cast_08703_const" type="Const" version="opset1">
			<data element_type="u8" offset="3995" shape="96,16,1,1" size="1536"/>
			<output>
				<port id="1" precision="U8">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_11/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_11/fq_weights_1/Copy/out_low7983_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_11/fq_weights_1/Copy/out_high7984_const" type="Const" version="opset1">
			<data element_type="f16" offset="5" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="14131417_const" type="Const" version="opset1">
			<data element_type="f16" offset="5531" shape="96,1,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="14141418_const" type="Const" version="opset1">
			<data element_type="f16" offset="5723" shape="96,1,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_11/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_11" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_1231912324/copy_const423_const" type="Const" version="opset1">
			<data element_type="f16" offset="5915" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="BatchNormalization_12/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Clip_13" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="15411545_const" type="Const" version="opset1">
			<data element_type="f16" offset="6107" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="15421546_const" type="Const" version="opset1">
			<data element_type="f16" offset="6299" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="15431547_const" type="Const" version="opset1">
			<data element_type="f16" offset="6107" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="15441548_const" type="Const" version="opset1">
			<data element_type="f16" offset="6299" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_14/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_14/fq_weights_1/Convert_to_float/Cast_08757_const" type="Const" version="opset1">
			<data element_type="u8" offset="6491" shape="96,1,3,3" size="864"/>
			<output>
				<port id="1" precision="U8">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_14/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_14/fq_weights_1/Copy/out_low7783_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_14/fq_weights_1/Copy/out_high7784_const" type="Const" version="opset1">
			<data element_type="f16" offset="5" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="15531557_const" type="Const" version="opset1">
			<data element_type="f16" offset="7355" shape="96,1,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="15541558_const" type="Const" version="opset1">
			<data element_type="f16" offset="7547" shape="96,1,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_14/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="9556/value9558_const" type="Const" version="opset1">
			<data element_type="i64" offset="7739" shape="5" size="40"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="9556" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_14" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="data_add_1232712332/copy_const428_const" type="Const" version="opset1">
			<data element_type="f16" offset="7779" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="BatchNormalization_15/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Clip_16" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="23412345_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="103" name="23422346_const" type="Const" version="opset1">
			<data element_type="f16" offset="7971" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="104" name="23432347_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="105" name="23442348_const" type="Const" version="opset1">
			<data element_type="f16" offset="7971" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="106" name="Conv_17/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_17/fq_weights_1/Convert_to_float/Cast_08673_const" type="Const" version="opset1">
			<data element_type="u8" offset="7973" shape="24,96,1,1" size="2304"/>
			<output>
				<port id="1" precision="U8">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_17/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_17/fq_weights_1/Copy/out_low7719_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_17/fq_weights_1/Copy/out_high7720_const" type="Const" version="opset1">
			<data element_type="f16" offset="5" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="23532357_const" type="Const" version="opset1">
			<data element_type="f16" offset="10277" shape="24,1,1,1" size="48"/>
			<output>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="23542358_const" type="Const" version="opset1">
			<data element_type="f16" offset="10325" shape="24,1,1,1" size="48"/>
			<output>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_17/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_17" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="data_add_1233512340/copy_const433_const" type="Const" version="opset1">
			<data element_type="f16" offset="10373" shape="1,24,1,1" size="48"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="BatchNormalization_18/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="18511855_const" type="Const" version="opset1">
			<data element_type="f16" offset="10421" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="118" name="18521856_const" type="Const" version="opset1">
			<data element_type="f16" offset="10423" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="119" name="18531857_const" type="Const" version="opset1">
			<data element_type="f16" offset="10421" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="120" name="18541858_const" type="Const" version="opset1">
			<data element_type="f16" offset="10423" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="121" name="Add_27/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_19/fq_weights_1/Convert_to_float/Cast_08785_const" type="Const" version="opset1">
			<data element_type="u8" offset="10425" shape="144,24,1,1" size="3456"/>
			<output>
				<port id="1" precision="U8">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv_19/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Conv_19/fq_weights_1/Copy/out_low7911_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Conv_19/fq_weights_1/Copy/out_high7912_const" type="Const" version="opset1">
			<data element_type="f16" offset="5" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="25532557_const" type="Const" version="opset1">
			<data element_type="f16" offset="13881" shape="144,1,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="25542558_const" type="Const" version="opset1">
			<data element_type="f16" offset="14169" shape="144,1,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Conv_19/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Conv_19" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="data_add_1234312348/copy_const437_const" type="Const" version="opset1">
			<data element_type="f16" offset="14457" shape="1,144,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="BatchNormalization_20/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Clip_21" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="16811685_const" type="Const" version="opset1">
			<data element_type="f16" offset="14745" shape="1,144,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="16821686_const" type="Const" version="opset1">
			<data element_type="f16" offset="15033" shape="1,144,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="16831687_const" type="Const" version="opset1">
			<data element_type="f16" offset="14745" shape="1,144,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="16841688_const" type="Const" version="opset1">
			<data element_type="f16" offset="15033" shape="1,144,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Conv_22/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Conv_22/fq_weights_1/Convert_to_float/Cast_08717_const" type="Const" version="opset1">
