<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
    <layers>
        <layer id="0" name="input" type="Parameter" version="opset1">
            <data shape="1,3,224,224" element_type="f32" />
            <output>
                <port id="0" precision="FP32" names="input">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>224</dim>
                    <dim>224</dim>
                </port>
            </output>
        </layer>
        <layer id="1" name="Range_7" type="Const" version="opset1">
            <data element_type="i64" shape="2" offset="0" size="16" />
            <output>
                <port id="0" precision="I64">
                    <dim>2</dim>
                </port>
            </output>
        </layer>
        <layer id="2" name="GlobalAveragePool_0" type="ReduceMean" version="opset1">
            <data keep_dims="true" />
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>224</dim>
                    <dim>224</dim>
                </port>
                <port id="1" precision="I64">
                    <dim>2</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="1">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="3" name="Constant_32" type="Const" version="opset1">
            <data element_type="i64" shape="2" offset="16" size="16" />
            <output>
                <port id="0" precision="I64">
                    <dim>2</dim>
                </port>
            </output>
        </layer>
        <layer id="4" name="2" type="Reshape" version="opset1">
            <data special_zero="true" />
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>1</dim>
                    <dim>1</dim>
                </port>
                <port id="1" precision="I64">
                    <dim>2</dim>
                </port>
            </input>
            <output>
                <port id="2" precision="FP32" names="2">
                    <dim>1</dim>
                    <dim>3</dim>
                </port>
            </output>
        </layer>
        <layer id="5" name="2/sink_port_0" type="Result" version="opset1">
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>3</dim>
                </port>
            </input>
        </layer>
    </layers>
    <edges>
        <edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
        <edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
        <edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
        <edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
        <edge from-layer="4" from-port="2" to-layer="5" to-port="0" />
    </edges>
    <rt_info>
        <MO_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
        <Runtime_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
        <conversion_parameters>
            <framework value="onnx" />
            <input_model value="DIR/dummy.onnx" />
            <model_name value="dummy" />
        </conversion_parameters>
        <legacy_frontend value="False" />
    </rt_info>
</net>
