name: "sam_encoder"
backend: "onnxruntime"
input [
    {
        name: "img"
        data_type: TYPE_FP32
        dims: [ 1, 3, -1, -1 ]
    }
]
output [
    {
        name: "image_embeddings"
        data_type: TYPE_FP32
        dims: [ -1, 256, -1, -1 ]
    }
]
